'''
튜플은 리스트와 유사하지만 값을 수정할 수 없으며, 읽기만 가능
튜플은 괄호로 생성
'''

# 튜플 인덱싱, 슬라이싱
t = (1, 2, 3, 4, 5, 6)
t[0]
t[:3]
t[4:6]


# 튜플 더하기, 곱하기
t1 = (1, 2)
t2 = ('a', 'b')

t3 = t1 + t2
t3   # (1, 2, 'a', 'b')

t1 * 3   # (1,2,1,2,1,2)


# 튜플 패킹 언패킹
a = 1, 2, 3
a  # (1, 2, 3)

one, two, three = a
print(one, thw, three)   # 1, 2, 3


# 튜플 함수
a.index(1)
a.count(1)


'''
집합은 순서없이 항목을 저장하며 항목이 중복되지 않음
'''

s1 = set([1,2,3])
s2 = {3,4,5}
s3 = set("Hello")
s3   # {"H", "e", "l", "O")


# 집합 관련 함수
s = {1, 2, 3, 4, 5, 3, 4 }
s  # {1, 2, 3, 4, 5}

s.add(10)   # {1, 2, 3, 4, 5, 10}
s.remove(2)  # {1, 3, 4, 5, 10}
s.update([1,3,5,7,9])   # {1, 3, 4, 5, 7, 9, 10}
s.discard(7)   # {1, 3, 4, 5, 9, 10}
s.clear()   # set()

s1 = {1, 2, 3}
s2 = {3, 4, 5}

s1.union(s2)  # {1, 2, 3, 4, 5}
s1.intersection(s2)  # {3}
s1 - s2  # {1, 2}
s1 | s2  # {1, 2, 3, 4, 5}
s1 & s2  # {3}
